<a href="https://colab.research.google.com/github/shanaka-desoysa/short-notes/blob/main/pandas_value_counts.ipynb" target="_blank"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Value Counts

In [2]:
import pandas as pd

## Create an Example Dataframe

In [4]:
data = {
    'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
    'year': [2012, 2012, 2013, 2014, 2014], 
    'reports': [4, 24, 31, 2, 3]
    }
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

             name  year  reports
Cochice     Jason  2012        4
Pima        Molly  2012       24
Santa Cruz   Tina  2013       31
Maricopa     Jake  2014        2
Yuma          Amy  2014        3

## Value Counts

In [5]:
df.year.value_counts()

2014    2
2012    2
2013    1
Name: year, dtype: int64